In [1]:
#pip install pandas
import pandas as pd
import sqlite3 as sql
import csv

In [8]:
#connect to the database
conn = sql.connect('tsc.db')
#create cursor
cursor = conn.cursor()

In [2]:
#read the csv file using pandas.
df = pd.read_csv("C:\\Users\\brenda.onyango\\Downloads\\tsc.csv")

In [3]:
# display the contents of the table declared as df
df

,COUNTY,School Type,Employment Body,No. of Teachers,County (centroid),Year
0,Baringo,Public,TSC,1172,"(0.669252, 35.946465)",12/31/2014 0:00
1,Bomet,Public,TSC,1379,"(-0.726295, 35.298598)",12/31/2014 0:00
2,Bungoma,Public,TSC,2946,"(0.749285, 34.640461)",12/31/2014 0:00
3,Busia,Public,TSC,1182,"(0.387444, 34.193631)",12/31/2014 0:00
4,Elgeyo Marakwet,Public,TSC,1087,"(0.802219, 35.536563)",12/31/2014 0:00
...,...,...,...,...,...,...
187,Uasin Gishu,Private,TSC,0,"(0.526086, 35.322012)",12/31/2014 0:00
188,Vihiga,Private,TSC,0,"(0.076266, 34.722323)",12/31/2014 0:00
189,Wajir,Private,TSC,0,"(1.808138, 40.034986)",12/31/2014 0:00
190,West Pokot,Private,TSC,0,"(1.740106, 35.243847)",12/31/2014 0:00
191,Kenya,Private,TSC,0,NaN,12/31/2014 0:00

In [4]:
#print the columns 
df.columns

Index(['COUNTY', 'School Type', 'Employment Body', 'No. of Teachers',
       'County (centroid)', 'Year'],
      dtype='object')

In [9]:
#drop the County column
df.drop('County (centroid)', axis=1, inplace=True) #inplace argument changes the dataframe, without it would just display desired results

In [10]:
df

,COUNTY,School Type,Employment Body,No. of Teachers,Year
0,Baringo,Public,TSC,1172,12/31/2014 0:00
1,Bomet,Public,TSC,1379,12/31/2014 0:00
2,Bungoma,Public,TSC,2946,12/31/2014 0:00
3,Busia,Public,TSC,1182,12/31/2014 0:00
4,Elgeyo Marakwet,Public,TSC,1087,12/31/2014 0:00
...,...,...,...,...,...
187,Uasin Gishu,Private,TSC,0,12/31/2014 0:00
188,Vihiga,Private,TSC,0,12/31/2014 0:00
189,Wajir,Private,TSC,0,12/31/2014 0:00
190,West Pokot,Private,TSC,0,12/31/2014 0:00
191,Kenya,Private,TSC,0,12/31/2014 0:00

In [48]:
df.columns.tolist()

['COUNTY', 'School Type', 'Employment Body', 'No. of Teachers', 'Year']

In [11]:
#Create Teachers Table
cursor.execute('''CREATE TABLE IF NOT EXISTS Teachers
               (COUNTY TEXT NOT NULL,
                SchoolType TEXT NOT NULL,
                EmploymentBody TEXT NOT NULL,
               NoOfTeachers INT NOT NULL, 
               Year DATETIME NOT NULL)''')
conn.commit()
print("Teachers")

Teachers

In [44]:
#convert the df to sqlite declared as sql
df.to_sql('Teacher', conn, if_exists='replace', index=False)

teacher=[]

tbl="<tr><td>COUNTY</td><td>School Type</td><td>Employment Body</td><td>No Of Teachers</td><td>Year</td></tr>"
teacher.append(tbl)

cursor.execute("SELECT * FROM Teachers")

for x in teachers:
    a = "<tr><td>%s</td>"%x[0]
    teacher.append(a)
    b = "<td>%s</td>"%x[1]
    teacher.append(b)
    c = "<td>%s</td>"%x[2]
    teacher.append(c)
    d = "<td>%s</td></tr>"%x[3]
    teacher.append(d)
    e = "<td>%s</td></tr>"%x[4]
    teacher.append(e)

C:\Users\brenda.onyango\Anaconda3\lib\site-packages\pandas\core\generic.py:2605: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  sql.to_sql(

In [46]:
#Display the Tsc DB on HTML
import webbrowser  #To launch the browser

f = open('hrec.html', 'w')

contents ='''<!DOCTYPE html>
<html>
<head>
<style>
body {background-color: cyan;}
<meta content ="text/html; charset=ISO-8859-1"
http-equiv="content-type">
<title>Teachers Data Output</title>
</head>
<body>
<table border="3" bordercolor="330000">
%s
</style>
</table>
</body>
</html>
'''%(teachers)

f.write(contents)
f.close()
webbrowser.open_new_tab('hrec.html')

True

In [47]:
html = df.to_html("tsc.html")
data = open("tsc.html", "r+")
data.close()

webbrowser.open_new_tab('tsc.html')

True

In [30]:
#tsc = pd.read_csv(r"C:\\Users\\brenda.onyango\\Downloads\\tsc.csv")
#df.to_html("tsc.html")
#with open ("tsc.html") as file:
 #   file = file.read()
#with open ("tsc.html", "w") as file_to_write:
#    os.startfile("tsc.html")